---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructureLayer.DeckProfileId
source: html/7bd864e9-3e9d-f4dd-ddf7-57e70ce8c8ba.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.DeckProfileId Property

The ElementId of the structural deck profile - only for a layer whose function is StructuralDeck.

## Syntax (C#)
```csharp
public ElementId DeckProfileId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null